_posts/programming/2023-04-17-cppcoreguidelines-es43.html
---
layout: post
title: CppCoreGuidelines ES.43 避免求值顺序未定义的表达式
categories: [technology]
tags: [CppCoreGuidelines]
---
<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
&ldquo;Avoid expressions with undefined order of evaluation&rdquo;
</p>

<p>
理由
</p>

<p>
有时候你无法判断代码到底做什么。可移植性的考量。就算你自己清楚代码在做什么，不同的编译器可能有不同的翻译。甚至你当前用的编译器的下一个版本翻译的都会不一样。或者不同的编译器选项会导致不同的求值结果。
</p>

<p>
注意
</p>

<p>
C++17 强化了求值顺序规则：一般都是从左到右，除了赋值操作是从右到左。但是没有定义函数参数列表的求值顺序规则。
</p>

<p>
请记住，如果你的代码能用C++17之前的编译器编译，但是不要太侥幸。
</p>


<p>
例子
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">i</span> = 10;
<span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">v</span><span style="color: #707183;">[</span>20<span style="color: #707183;">]</span>;

v<span style="color: #707183;">[</span>i<span style="color: #707183;">]</span> = ++i;   <span style="color: #3F7F5F;">//  </span><span style="color: #3F7F5F;">the result is undefined</span>
cout &lt;&lt; v<span style="color: #707183;">[</span>i<span style="color: #707183;">]</span>;
</pre>
</div>

<pre class="example">
11
</pre>


<p>
总归一句话，不要在一个表达式中多次读取一个变量的值。
</p>

<p>
强化
</p>

<p>
好的代码分析工具能够提出告警。
</p>
